yashwanth-techolution/blinky/src/ADO_STM32H7_WW.c
#include <zephyr/device.h>
#include <zephyr/devicetree.h>
#include <zephyr/drivers/flash.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/spi.h>
#include <errno.h>
#include <hal/nrf_gpio.h>
#include <inttypes.h>
#include <zephyr/kernel.h>
#include <math.h>
#include <stdio.h>
#include <string.h>
#include <zephyr/sys/printk.h>
#include <zephyr/sys/util.h>

#include "ESP8266_WiFi_lib/WiFiSpi.h"
#include "Includes/ADO_Audio_files.h"
#include "Includes/ADO_PIR_Module.h"
#include "Includes/ADO_STM32H7_WW.h"
#include "Includes/Command_Manager_Module.h"
#include "Includes/EEPROM_Module.h"
#include "Includes/Intent_Module.h"
#include "Includes/SPI_Module.h"

#include "Includes/ADO_Flash_Module.h"
#include "Includes/ADO_WiFi_Module.h"
#include "Includes/Display_Module.h"

struct stm_ota_update_status_t stm_ota_update_status;

static struct gpio_callback stm32_inrpt_cb_data;
const struct device *STM32_interrupt_pin;
uint16_t ww_from_server = 0;

uint8_t spi_read_buffer[MAX_SPI_BUFF_LEN];
uint16_t receive_bytes = MAX_SPI_BUFF_LEN;
uint8_t set_ack_flag = 0;

bool stm32_interrupt_flag = false;


// OTA update flags
bool ota_updating = false;
bool OTA_update_pending = false;
bool check_for_ota_update = false;
bool download_the_ota_update = false;
bool send_and_flash_ota_update = false;
bool dump_audio_file_to_server = false;

uint16_t stm_wake_word_count = 0;
uint8_t stm32_present_audio_file_read_count = 0;

uint32_t store_stm32_hex_file_address = STM32_HEX_FILE_START_ADDRESS;

int8_t read_stm32_hex_file(uint8_t *hex_buffer);

int8_t Read_from_STM32(uint8_t *in, uint16_t *read_data_lenght) {
  int err = 0;
  uint16_t buffer_rx_length_stm = 0; // buffer length stm wants to send
  uint8_t rx_cmd_buffer[CMD_BYTE] = {0};

  err = stm_spi_read(rx_cmd_buffer, CMD_BYTE);
  buffer_rx_length_stm = (((rx_cmd_buffer[1] & 0x7F) << 8) | rx_cmd_buffer[0]);
  *read_data_lenght = buffer_rx_length_stm;
  printk("buffer length = %d read data from STM\n", buffer_rx_length_stm);

  if (buffer_rx_length_stm) {
    err = stm_spi_read(in, buffer_rx_length_stm);
  }
  return err;
}

int8_t Send_ACK_to_STM32() {
  int err = 0;
  uint8_t rx_ack_buff[ACK_BYTE];

  rx_ack_buff[0] = 0;
  rx_ack_buff[1] = 0;
  rx_ack_buff[2] = ACK_RX_CMP;
  err = stm_spi_send(rx_ack_buff, ACK_BYTE);
  return err;
}

int8_t Send_Data_to_STM32(uint8_t *out, uint16_t length) {
  int err;
  err = stm_spi_send(out, length);
  return err;
}

int8_t Send_CMD_to_STM32(uint8_t message_type, uint16_t length, uint8_t read_write) {
  int err;
  uint8_t data_chunk = 0;
  uint8_t chunk_num = 0;
  uint8_t tx_cmd_buffer[CMD_BYTE]; // command buffer

  tx_cmd_buffer[0] = (length & 0xFF);
  tx_cmd_buffer[1] = ((length >> 8) & 0xFF);
  tx_cmd_buffer[1] = ((tx_cmd_buffer[1] & 0x7F) | read_write);
  tx_cmd_buffer[2] = data_chunk;
  tx_cmd_buffer[3] = chunk_num;
  tx_cmd_buffer[4] = message_type;

  err = stm_spi_send(tx_cmd_buffer, CMD_BYTE);
  return err;
}

/*
   brief: It is a callback function triggered on an stm32 GPIO interrupt,
          when there is a wake word detected.
*/
void STM32_wake_word_detected(const struct device *dev, struct gpio_callback *cb, uint32_t pins) {
  // Debug print
  printk("STM32 interrupt Detected........................\n");
  stm32_interrupt_flag = true;
  stop_wifi_send = true; // uncommented this line
  //new_wifi_cred = false; // uncommented this line
  is_bot_staginated2 = false;
}

/* This function sets up the STM32 interrupt pin for GPIO, configures the
interrupt to trigger on a rising edge, associates a callback function with
the interrupt, and provides error handling in case any of the configurations fail.
*/

int8_t interrupt_gpio_stm32() {
  int ret;
  STM32_interrupt_pin = device_get_binding(STM32_INRPT_GPIO_LABEL);

  if (STM32_interrupt_pin == NULL) {
    printk("Error: didn't find %s device\n", STM32_INRPT_GPIO_LABEL);
    return -1;
  }

  ret = gpio_pin_configure(STM32_interrupt_pin, STM32_INRPT_GPIO_PIN, STM32_INRPT_GPIO_FLAGS);
  if (ret != 0) {
    printk("Error %d: failed to configure %s pin %d\n",
        ret, STM32_INRPT_GPIO_LABEL, STM32_INRPT_GPIO_PIN);
    return -2;
  }

  ret = gpio_pin_interrupt_configure(STM32_interrupt_pin, STM32_INRPT_GPIO_PIN, GPIO_INT_EDGE_RISING);
  if (ret != 0) {
    printk("Error %d: failed to configure interrupt on %s pin %d\n",
        ret, STM32_INRPT_GPIO_LABEL, STM32_INRPT_GPIO_PIN);
    return -3;
  }

  gpio_init_callback(&stm32_inrpt_cb_data, STM32_wake_word_detected, BIT(STM32_INRPT_GPIO_PIN));
  gpio_add_callback(STM32_interrupt_pin, &stm32_inrpt_cb_data);
  printk("Set up button at %s pin %d\n", STM32_INRPT_GPIO_LABEL, STM32_INRPT_GPIO_PIN);
  return 0;
}

/* This function initializes the STM32H7 microcontroller by configuring GPIO
pins for SPI chip select and enable signals, sets up an interrupt for a GPIO
pin, reads data from flash memory, and performs additional operations on the
retrieved data.
*/

void init_STM32H7() {
  nrf_gpio_cfg_output(STM32_SPI_CS);
  nrf_gpio_pin_set(STM32_SPI_CS);
  nrf_gpio_cfg_output(STM32_EN);
  nrf_gpio_pin_set(STM32_EN);
  // nrf_gpio_pin_clear(STM32_EN);

  interrupt_gpio_stm32();
  int8_t error = 0;

  error = external_flash_file_read(STM32_FILES_VERSION_STORE_ADDRESS, (uint8_t *)&stm_ota_update_status, sizeof(stm_ota_update_status));
  if (error) {
    printk("Error reading file from flash memory\n");
  }

  printk("-----------------------------------------------------\n");
  download_the_ota_update = stm_ota_update_status.is_stm_ota_update_available;
  send_and_flash_ota_update = stm_ota_update_status.is_stm_update_downloaded;
  if (download_the_ota_update && send_and_flash_ota_update) {
    download_the_ota_update = false;
    send_and_flash_ota_update = false;
  }
  printk("stm fw version = %s\n", stm_ota_update_status.stm_fw_ver);
  printk("-----------------------------------------------------\n");
}

/* This function is checking for wake words or specific patterns in the data
received from an STM32 microcontroller.
*/

