yashwanth-techolution/blinky/src/ADO_STM32H7_WW.c
uint8_t check_stm32_ww() {
  uint8_t in = 0;
  uint16_t received_data_length;
  // uint32_t start_time, end_time, exec_time;

  for (int i = 0; i < 5; i++) {
    if (stm32_interrupt_flag == true) {
      printk("######################################\n");
      stm32_interrupt_flag = false;
      printk("-----reading-----\n");
      Read_from_STM32(spi_read_buffer, &received_data_length);
      printk("----completed----\n");
      k_msleep(270); // wait until STM32 stores audio file into it's external flash.

      if (received_data_length == 2) {
        stm32_present_audio_file_read_count = spi_read_buffer[1];
        printk("--- %d files stored in STM\n", stm32_present_audio_file_read_count);
        printk(" Response = %x  \n", spi_read_buffer[0]); // Check response
        not_confident_sent = false;

        switch (spi_read_buffer[0]) {
        case 0x09:
        if(run_in_intent_mode){
          printk("Match -> Door_Open_LT\n");
          return NON_WAKE_WORD;
          }
          else printk(".");
          break;

        case 0x0A:
          if(run_in_intent_mode) {
          printk("Match -> Door_Open\n");
          return DOOR_OPEN;
          }
          else printk(".");
          break;

        case 0x0B:
          printk("Match -> Door_Close\n");
          return DOOR_CLOSE;
          break;

        case 0x0C:
          printk("Match -> Door_Stop\n");
          chg_display_page(DISP_DOOR_STOP);
          return DOOR_STOP;
          break;

        case 0x0D:
          printk("Match -> Door_Stop_LT\n");
          return NON_WAKE_WORD;
          break;

        case 0x0E:
          printk("Match -> Door_Close_LT\n");
          return NON_WAKE_WORD;
          break;

        default:
          break;
        }
      } else if (received_data_length == 32001) {
        printk(" Response = %x  \n", spi_read_buffer[0]); // Response 0x0F is comming properly.

        if (spi_read_buffer[0] == 0x0F) {
          printk("Match -> NOT_CONFIDENT\n");

          //if ((disp_status != DISP_DOOR_OPENING_PAGE) && (disp_status != DISP_DOOR_CLOSING_PAGE)) {
          //   chg_display_page(DISP_PLEASE_SAY_AGAIN);
          //}

          // start_time = k_cycle_get_32();
          // printk("%d\n", spi_read_buffer[0]);

          //Store Audio file in flash.

          //Store_audio_file(&spi_read_buffer[1], stm_wake_word_count);  //Uttam added for testing
          //printk("\n--------------------------- Store Not Confident file in Nordic Flash -------------------\n");
          //Store_not_confident_audio_file(&spi_read_buffer[1], stm_wake_word_count);
          //stored_audio_files_count();  //Print no of Stored Audio File.

          stop_wifi_send = false;
          int ret = Send_Raw_Audio_File_To_Server(&spi_read_buffer[1], received_data_length - 1, false);

          if (ret != SERVER_CONNECTION_FAILED) {

            if (stm32_interrupt_flag == true) {
              printf("\n----------------------- Break Not_Confident loop \n");
              continue;
            }

            printf("\n ===> Read not_confident response");
            int ret = Get_data_from_auto_ai(false);

            if (ww_from_server) {
              not_confident_sent = false;
              printf("\n===> Read not_confident ww_from_server %d \n", ww_from_server);
              break;
              //  return ww_from_server;
            }
          } else {
            ret = Send_Raw_Audio_File_To_Server(&spi_read_buffer[1], received_data_length - 1, false);

            if (ret != SERVER_CONNECTION_FAILED) {
              printf("\n ===> Read not_confident response");
              int ret = Get_data_from_auto_ai(false);

              if (ww_from_server) {
                not_confident_sent = false;
                printf("\n===> Read not_confident ww_from_server %d \n", ww_from_server);
                //   return ww_from_server;
                break;
              }
            } else {
              printk("Server retry also failed");
            }
          }

          // printf("\n===> Read not_confident ww_from_server %d \n",ww_from_server);
          // end_time = k_cycle_get_32();

          // Calculate the execution time in microseconds
          // exec_time = ((end_time - start_time) / (32768 / 1000));
          // printk("\nTotal Processing time = %d ms\n", exec_time);

          // for(int i=0;i<32000;i++)
          // {
          //   printk("%d ",spi_read_buffer[i+1]);
          // }
        }
      }
    }
    k_msleep(100U);
  }
  return in;
}

uint8_t stm32_audio_files_read() {
  uint8_t in = 0;
  uint16_t received_data_length;
  uint8_t audio_fil_count = 0;

  if (stm32_interrupt_flag == true) {
    return in;
  }

  while ((stm32_present_audio_file_read_count >= 1) && (stm32_present_audio_file_read_count <= 32)) {
    Send_CMD_to_STM32(AUDIO_SPI_DATA, 0, STM32_READ_CMD);
    k_msleep(200);

    if (stm32_interrupt_flag == true) {
      printk("stm intrupt detected\n");
      return in;
    }

    memset(spi_read_buffer, '\0', MAX_SPI_BUFF_LEN);
    printk("+++++reading+++++\n");
    Read_from_STM32(spi_read_buffer, &received_data_length);
    k_msleep(100);
    Send_ACK_to_STM32();
    printk("++++completed++++\n");

    stm32_present_audio_file_read_count = spi_read_buffer[0];
    audio_fil_count = stm32_present_audio_file_read_count;
    printk("-----Remainig audio files in STM32 = %d\n", stm32_present_audio_file_read_count);

    if ((stm32_present_audio_file_read_count < 1) || (received_data_length == 0)) {
      return 0;
    }

    if (received_data_length >= 32000) {
      switch (spi_read_buffer[1]) {
      case 0x09:
        printk("Read audio file Door_Open_LT --- %d\n", ++stm_wake_word_count);
        Store_audio_file(&spi_read_buffer[1], stm_wake_word_count);
        break;

      case 0x0A:
        printk("Read audio file Door_Open   --- %d\n", ++stm_wake_word_count);
        Store_audio_file(&spi_read_buffer[1], stm_wake_word_count);
        break;

      case 0x0B:
        printk("Read audio file Door_Close  --- %d\n", ++stm_wake_word_count);
        Store_audio_file(&spi_read_buffer[1], stm_wake_word_count);
        break;

