yashwanth-techolution/blinky/src/ADO_STM32H7_WW.c
      case 0x0C:
        printk("Read audio file Door_stop  --- %d\n", ++stm_wake_word_count);
        Store_audio_file(&spi_read_buffer[1], stm_wake_word_count);
        break;

      case 0x0D:
        printk("Read audio file Door_stop_LT  --- %d\n", ++stm_wake_word_count);
        Store_audio_file(&spi_read_buffer[1], stm_wake_word_count);
        break;

      case 0x0E:
        printk("Read audio file Door_close_LT  --- %d\n", ++stm_wake_word_count);
        Store_audio_file(&spi_read_buffer[1], stm_wake_word_count);
        break;

      default:
        break;
      }
      printk("xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx\n");
    }
    stm32_present_audio_file_read_count = audio_fil_count;
  }
  return in;
}

uint8_t stm32_version_numbers_read() {
  uint16_t received_data_length;
  char *version;

  if (stm32_interrupt_flag == true) {
    return 0;
  }

  Send_CMD_to_STM32(GET_VERSION_NUMBERS, 0, STM32_READ_CMD);
  k_msleep(200);

  if (stm32_interrupt_flag == true) {
    return 0;
  }

  Read_from_STM32(spi_read_buffer, &received_data_length);
  k_msleep(100);
  Send_ACK_to_STM32();

  if (received_data_length >= 8) {
    version = &spi_read_buffer[0];
    printk("Version numbers are = %s\n", version);
  }
  return 0;
}

/*
 * brief: This function puts stm32 into sleep mode based on called argument command.
 */
int8_t STM32_sleep_control(bool on) {
  // Set the stm32 sleep GPIO
  if ((STM32_RUN_MODE) == on) {
    nrf_gpio_pin_clear(STM32_EN);
  } else {
    nrf_gpio_pin_set(STM32_EN);
  }
  return 0;
}

/* -------------------------- ALL functions related to OTA update added here --------------------- */

/* Added for downloading STM Hex file */
bool Check_stm_OTA_update_availble() {
  int8_t wifi_status = 0;
  bool ret = false;

  // stm_ota_update_status.stm_fw_ver="v0.0.0";    //added for  testing

  if (!wifi_module_active) {
    printk("WiFi module is off.\nTurning it on...\n");
    WiFi_module_on_off(WIFI_MODULE_ON);
    k_msleep(1500);
  }

  wifi_status = ADO_WiFi_status(NULL);

  if (WL_CONNECTED != wifi_status) {
    printk("WiFi connection status = %d\nTrying second time\n", wifi_status);
    wifi_status = WiFi_Network_Connect(NULL);

    if (WL_CONNECTED != wifi_status) {
      printk("check your wifi connection\n");
      return false;
    }
  }
  printk("\n--------------------------------------------------------------\n");
  printk("Current fw version = %s\n", stm_ota_update_status.stm_fw_ver);
  stm_ota_update_status.stm_fw_ver[14] = 0;
  strcpy(stm_ota_update_status.stm_old_fw_ver, stm_ota_update_status.stm_fw_ver); // ----------------added by ashok

  ret = request_and_cmp_stm_fw_version(stm_ota_update_status.stm_fw_ver, NULL);

  printk("OTA fw version = %s\n", stm_ota_update_status.stm_fw_ver);
  printk("\n-------------------------------------------------------------\n");
  return ret;
}

int8_t Download_stm_hex_file() {
  int8_t wifi_status = -1;

  if (!wifi_module_active) {
    printk("WiFi module is off for downloading the file.\nTurning it on...\n");
    WiFi_module_on_off(WIFI_MODULE_ON);
    k_msleep(1500);
  }
  wifi_status = ADO_WiFi_status(NULL);

  if (WL_CONNECTED != wifi_status) {
    printk("WiFi connection status = %d\nTrying second time\n", wifi_status);
    wifi_status = WiFi_Network_Connect(NULL);

    if (WL_CONNECTED != wifi_status) {
      printk("Check your wifi connection\n");
      return wifi_status;
    }
  }

  store_stm32_hex_file_address = STM32_HEX_FILE_START_ADDRESS;
  wifi_status = request_and_download_stm_hex_file_from_server(NULL);
  return wifi_status;
}

int8_t validate_stm_new_hex_file_chunk(char *hex_buffer, uint16_t size) {
  printk("Checking HEX file Chunk\n");

  hex_buffer[size + 2] = '\0';
  // printk("%s\n", hex_buffer+2);

  for (int i = 0; i < size; i++) {
    if ((hex_buffer[i + 2] == '\r') || (hex_buffer[i + 2] == '\n')) {
      continue;
    } else if ((hex_buffer[i + 2] >= 'A') && (hex_buffer[i + 2] <= 'F')) {
      continue;
    } else if ((hex_buffer[i + 2] < '0') || (hex_buffer[i + 2] > ':')) {
      printk("\n Error idex id = %d, %X\n", i, (uint8_t)hex_buffer[i + 2]);
      return -1;
    }
  }
  return 0;
}

int8_t validate_stm_new_hex_file() {
  uint16_t data_size = 0;
  store_stm32_hex_file_address = STM32_HEX_FILE_START_ADDRESS;
  printk("Checking HEX file\n");

  while (1) {
    memset(body, '\0', 32769);
    read_stm32_hex_file((uint8_t *)&body[0]);
    data_size = (uint16_t)((uint8_t)body[0] | ((uint8_t)body[1] << 8));

    body[data_size + 2] = '\0';
    // printk("%s\n", body+2);

    for (int i = 0; i < data_size; i++) {
      // printk("%c", body[i+2]);
      if ((body[i + 2] == '\r') || (body[i + 2] == '\n')) {
        continue;
      } else if ((body[i + 2] >= 'A') && (body[i + 2] <= 'F')) {
        continue;
      } else if ((body[i + 2] < '0') || (body[i + 2] > ':')) {
        printk("\n Error idex id = %d, %X\n", i, (uint8_t)body[i + 2]);
        return -1;
      }
    }
    k_msleep(10);

    if (data_size < MAX_LEN) {
      break;
    }
  }
  return 0;
}

int8_t stm_hex_file_ack_receive(uint32_t timeout) {
  uint16_t received_data_length;
  unsigned long int time_stamp = k_uptime_get();

  while (stm32_interrupt_flag != true) {
    k_msleep(50);
    if ((k_uptime_get() - time_stamp) >= timeout) {
      return -1;
    }
    printk("-");
  }
  stm32_interrupt_flag = false;
  k_msleep(50);
  Read_from_STM32(spi_read_buffer, &received_data_length);
  printk("Reply got reading = %d, %d\n", received_data_length, spi_read_buffer[0]);

  if (received_data_length == 2) {
    return spi_read_buffer[0];
  }
  return -1;
}

int8_t send_nex_hex_file_to_stm32() {
  int i = 0;
  printk("Hex file sending to STM\n");
  // Send_CMD_to_STM32(STM_SOFT_RESTART, 0, STM32_WRITE_CMD);
  Send_CMD_to_STM32(STM_NEW_FW, 0, STM32_WRITE_CMD);
  k_msleep(400);

  Send_CMD_to_STM32(HEX_FILE_TRANSFER_START, 0, STM32_WRITE_CMD);
  k_msleep(50);

  if (stm_hex_file_ack_receive(5000) != HEX_FILE_TRANSFER_STARTED) {
    printk("\nxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx.\n");
    return -1;
  }

