yashwanth-techolution/blinky/src/ADO_STM32H7_WW.c
  uint16_t data_size = 0;
  store_stm32_hex_file_address = STM32_HEX_FILE_START_ADDRESS;

  while (1) {
    memset(body, '\0', 32769);
    read_stm32_hex_file((uint8_t *)&body[0]);
    data_size = (uint16_t)((uint8_t)body[0] | ((uint8_t)body[1] << 8));

    body[data_size + 2] = '\0';

    Send_CMD_to_STM32(HEX_FILE_TRANSFER_CONTINUE, (data_size + 2), STM32_WRITE_CMD);
    k_msleep(50);
    if (stm_hex_file_ack_receive(2000) != HEX_FILE_TRANSFER_CONTINUE) {
      printk("Hex file transfer failed in middle\n");
      return -1;
    }

    k_msleep(50);
    Send_Data_to_STM32((uint8_t *)body, (data_size + 2));
    printk("Buffer len = %d\n", (data_size + 2));
    // printk("%s\n", body+2);
    k_msleep(350);

    if (data_size < MAX_LEN) {
      k_msleep(50);
      Send_CMD_to_STM32(HEX_FILE_TRANSFER_DONE, 0, STM32_WRITE_CMD);
      k_msleep(50);

      if (stm_hex_file_ack_receive(2000) != HEX_FILE_TRANSFER_DONE) {
        printk("Hex file transfer failed in middle\n");
        return -1;
      }
      printk("Data send completed\n");

      if (stm_hex_file_ack_receive(5000) == HEX_FILE_RECEIVED_OK) {
        printk("Hex file transfered to stm okay.\n");
      } else {
        printk("Hex file transfered to stm failed.\n");
        return -1;
      }
      k_msleep(50);
      break;
    }
  }
  return 0;
}

int8_t flash_nex_hex_file_to_stm32() {
  k_msleep(1000);
  while (1) {
    switch (stm_hex_file_ack_receive(5000)) {
    case HEX_FILE_FOUND:
      printk("Hex file found okay in bootloader code.\n");
      break;

    case HEX_FILE_RECEIVED_GARBAGE:
      printk("Hex file garbage in bootloader code.\n");
      return -1;
      break;

    case HEX_FILE_FLASHING:
      printk("Hex file flashing in bootloader code.\n");
      break;

    case HEX_FILE_FLASH_DONE:
      printk("Hex file flash done in bootloader code.\n");
      return 0;
      break;

    default:
      break;
    }
  }
  return 0;
}

int8_t store_stm32_hex_file(char *hex_buffer, uint16_t size) {
  int8_t error = 0;
  uint16_t data_size = (uint16_t)(hex_buffer[0] | (hex_buffer[1] << 8));
  printk("hex buffer size = %d, %d, %d, %d\n", size, data_size,
      (uint8_t)hex_buffer[0], (uint8_t)hex_buffer[1]);

  if ((store_stm32_hex_file_address % MAX_FLASH_ERASE_LEN) == 0) {
    printk("erasing hole block\n");
    error = external_flash_block_erase(store_stm32_hex_file_address, 0);
    if (error) {
      printk("Error erasing flash memory location\n");
      return error;
    }
  }

  printk("\nstore stm32 hex file address = 0x%08X\n", store_stm32_hex_file_address);
  error = external_flash_file_write(store_stm32_hex_file_address, hex_buffer, (uint32_t)size);

  if (error) {
    printk("Error saving file into flash memory\n");
    return error;
  }

  store_stm32_hex_file_address = store_stm32_hex_file_address + FLASH_AUDIO_ADDRESS_INCREMENT;
  return 0;
}

int8_t store_stm_ota_update_status(uint8_t update_stage, bool state) {
  int8_t error = 0;
  printk("erasing hole block\n");
  error = external_flash_block_erase(STM32_FILES_VERSION_STORE_ADDRESS, 0);

  if (error) {
    printk("Error erasing flash memory location\n");
    return error;
  }

  switch (update_stage) {
  case UPDATE_FOUND:
    stm_ota_update_status.is_stm_ota_update_available = state;
    stm_ota_update_status.is_stm_update_downloaded = false;
    stm_ota_update_status.is_stm_update_send = false;
    if(!state)
    {
      printk("OTA fw version = %s\n", stm_ota_update_status.stm_fw_ver);
      stm_ota_update_status.stm_old_fw_ver[14] = 0;
      strcpy(stm_ota_update_status.stm_fw_ver, stm_ota_update_status.stm_old_fw_ver); // --added by ashok
      printk("Current fw version = %s\n", stm_ota_update_status.stm_fw_ver);
    }
    break;

  case UPDATE_DOWNLOADED:
    // NOTE: if state == false store old fw string back into external flash.
    if (!state) {
      printk("\n--------------------------------------------------------------\n");
      printk("OTA tried for 10 times and failed.\n");
      printk("OTA fw version = %s\n", stm_ota_update_status.stm_fw_ver);
      stm_ota_update_status.stm_old_fw_ver[14] = 0;
      strcpy(stm_ota_update_status.stm_fw_ver, stm_ota_update_status.stm_old_fw_ver); // --added by ashok
      printk("Current fw version = %s\n", stm_ota_update_status.stm_fw_ver);
      printk("-------------------------------------------------------------\n");
    }
    stm_ota_update_status.is_stm_ota_update_available = false;
    stm_ota_update_status.is_stm_update_downloaded = state;
    stm_ota_update_status.is_stm_update_send = false;
    break;

  case UPDATE_SEND_TO_STM:
    // NOTE: if state == false store old fw string back into external flash.
    if (!state) {
      printk("\n--------------------------------------------------------------\n");
      printk("OTA tried for 10 times and failed.\n");
      printk("OTA fw version = %s\n", stm_ota_update_status.stm_fw_ver);
      stm_ota_update_status.stm_old_fw_ver[14] = 0;
      strcpy(stm_ota_update_status.stm_fw_ver, stm_ota_update_status.stm_old_fw_ver); // --added by ashok
      printk("Current fw version = %s\n", stm_ota_update_status.stm_fw_ver);
      printk("-------------------------------------------------------------\n");
    }

    stm_ota_update_status.is_stm_ota_update_available = false;
    stm_ota_update_status.is_stm_update_downloaded = false;
    stm_ota_update_status.is_stm_update_send = state;
    break;

  case UPDATE_FLASHED_INTO_STM:
    break;

  default:
    break;
  }

  error = external_flash_file_write(STM32_FILES_VERSION_STORE_ADDRESS,
      (uint8_t *)&stm_ota_update_status, sizeof(stm_ota_update_status));
  if (error) {
    printk("Error saving file into flash memory\n");
    return error;
  }

  printk("after storing fw_version in qspi is  = %s", stm_ota_update_status.stm_fw_ver);
  return 0;
}

int8_t read_stm32_hex_file(uint8_t *hex_buffer) {
  int8_t error = 0;
  error = external_flash_file_read(store_stm32_hex_file_address,
      (uint8_t *)body, FLASH_AUDIO_ADDRESS_INCREMENT);
  
  if (error) {
    printk("Error reading file from flash memory\n");
    // return error;
  }
  store_stm32_hex_file_address = store_stm32_hex_file_address + FLASH_AUDIO_ADDRESS_INCREMENT;
  return 0;
}

void stm_old_new_fw_version_to_edge_device(uint8_t *stm_old_new_ver_numbers) {
  char *version_str = NULL;
  char var[3] = {0};
  int i = 0;
  version_str = stm_ota_update_status.stm_old_fw_ver;
  memset(var, 0, sizeof(var));
  version_str++;

  while (*version_str != '.') {
    var[i++] = *(version_str++);
  }

  stm_old_new_ver_numbers[0] = atoi(var);
  memset(var, 0, sizeof(var));
  i = 0;
  version_str++;

  while (*version_str != '.') {
    var[i++] = *(version_str++);
  }

  stm_old_new_ver_numbers[1] = atoi(var);
  memset(var, 0, sizeof(var));
  i = 0;
  version_str++;

  while (*version_str != '\0') {
    var[i++] = *(version_str++);
  }

  stm_old_new_ver_numbers[2] = atoi(var);
  version_str = stm_ota_update_status.stm_fw_ver;
  memset(var, 0, sizeof(var));
  i = 0;
  version_str++;

  while (*version_str != '.') {
    var[i++] = *(version_str++);
  }

  stm_old_new_ver_numbers[3] = atoi(var);
  memset(var, 0, sizeof(var));
  i = 0;
  version_str++;

  while (*version_str != '.') {
    var[i++] = *(version_str++);
  }

  stm_old_new_ver_numbers[4] = atoi(var);
  memset(var, 0, sizeof(var));
  i = 0;
  version_str++;

  while (*version_str != '\0') {
    var[i++] = *(version_str++);
  }
  stm_old_new_ver_numbers[5] = atoi(var);
  printk("new fw is %s and old fw is %s", stm_ota_update_status.stm_fw_ver,
      stm_ota_update_status.stm_old_fw_ver);
}